app/Controllers/Auth/Auth.php

    public function paymentDashboard()
    {
            $LoggedinId = $this->session->get('id');
            $userinfo = $this->UserModel->find($LoggedinId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '437'

    public function update()
    {
        $userinfo = $this->UserModel->find($LoggedinId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '437'