app/Controllers/Admin.php

SELECT *
FROM `admin`
WHERE `email` = 'zain.pny@gmail.com'
 LIMIT 1
---
    public function authenticate()
    {
        if (session()->get('logged_in')) {
            return redirect()->to('admin/dashboard');
        }
        $session = session();
        $model = new AdminModel();
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('pass');
        $data = $model->where('email', $email)->first();

SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
---
    public function dashboard()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('admin/login');
        }
        $db = \Config\Database::connect();
        $session = session();
        $userModel = new \App\Models\AdminModel();
        $LoggedinId = $session->get('id');
        $userinfo = $userModel->find($LoggedinId);

SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
---
    public function pendingClients()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to('admin/login');
        }
        $db = \Config\Database::connect();
        $session = session();
        $AdminModel = new \App\Models\AdminModel();
        $UserModel = new \App\Models\UserModel();
        $LoggedinId = $session->get('id');
        $userinfo = $AdminModel->find($LoggedinId);

SELECT *
FROM `users`
WHERE `users`.`id` = '12'
---
    public function edit($id)
    {
//        var_dump($id);
//        die();
        $model = new \App\Models\UserModel();

        $modelData = $model->find($id);

SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
---
public function widthrawal(){
    if (!session()->get('logged_in')) {
        return redirect()->to('admin/login');
    }
    $db = \Config\Database::connect();
    $session = session();
    $userModel = new \App\Models\AdminModel();
    $LoggedinId = $session->get('id');
    $userinfo = $userModel->find($LoggedinId);